---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRunActualTreadDepth
source: html/e6c4e70a-5db9-9269-ae70-a0d62f2d090d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRunActualTreadDepth Property

"Actual Tread Depth": Actual Tread Depth

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRunActualTreadDepth { get; }
```